{
    "modelTopology": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 16000],
              "dtype": "float32",
              "name": "input_1",
              "ragged": false,
              "sparse": false
            }
          },
          {
            "class_name": "Reshape",
            "config": {
              "name": "reshape",
              "target_shape": [16000, 1]
            }
          },
          {
            "class_name": "Normalization",
            "config": {
              "axis": -1,
              "mean": 0.0,
              "name": "normalization",
              "variance": 1.0
            }
          },
          {
            "class_name": "Conv1D",
            "config": {
              "activation": "relu",
              "activity_regularizer": null,
              "bias_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "dilation_rate": [1],
              "dtype": "float32",
              "filters": 32,
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "kernel_regularizer": null,
              "kernel_size": [3],
              "name": "conv1d",
              "padding": "valid",
              "strides": [1],
              "use_bias": true
            }
          },
          {
            "class_name": "MaxPooling1D",
            "config": {
              "name": "max_pooling1d",
              "pool_size": [2],
              "strides": [2],
              "padding": "valid"
            }
          },
          {
            "class_name": "Conv1D",
            "config": {
              "activation": "relu",
              "activity_regularizer": null,
              "bias_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "dilation_rate": [1],
              "dtype": "float32",
              "filters": 64,
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "kernel_regularizer": null,
              "kernel_size": [3],
              "name": "conv1d_1",
              "padding": "valid",
              "strides": [1],
              "use_bias": true
            }
          },
          {
            "class_name": "MaxPooling1D",
            "config": {
              "name": "max_pooling1d_1",
              "pool_size": [2],
              "strides": [2],
              "padding": "valid"
            }
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "activation": "relu",
              "activity_regularizer": null,
              "bias_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "dtype": "float32",
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "kernel_regularizer": null,
              "name": "dense",
              "units": 128,
              "use_bias": true
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "activation": "softmax",
              "activity_regularizer": null,
              "bias_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "dtype": "float32",
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "kernel_regularizer": null,
              "name": "dense_1",
              "units": 10,
              "use_bias": true
            }
          }
        ]
      },
      "keras_version": "2.4.0",
      "backend": "tensorflow"
    },
    "format": "layers-model",
    "generatedBy": "keras v2.4.0",
    "convertedBy": "TensorFlow.js Converter v1.7.4",
    "weightsManifest": [
      {
        "paths": ["group1-shard1of1.bin"],
        "weights": [
          {
            "name": "conv1d/kernel",
            "shape": [3, 1, 32],
            "dtype": "float32"
          },
          {
            "name": "conv1d/bias",
            "shape": [32],
            "dtype": "float32"
          },
          {
            "name": "conv1d_1/kernel",
            "shape": [3, 32, 64],
            "dtype": "float32"
          },
          {
            "name": "conv1d_1/bias",
            "shape": [64],
            "dtype": "float32"
          },
          {
            "name": "dense/kernel",
            "shape": [3968, 128],
            "dtype": "float32"
          },
          {
            "name": "dense/bias",
            "shape": [128],
            "dtype": "float32"
          },
          {
            "name": "dense_1/kernel",
            "shape": [128, 10],
            "dtype": "float32"
          },
          {
            "name": "dense_1/bias",
            "shape": [10],
            "dtype": "float32"
          }
        ]
      }
    ]
  }
  